[
["Quotation. The act of repeating erroneously the words of another. The words erroneously repeated.",
 "Ambrose Bierce", "https://en.wikisource.org/wiki/The_Devil%27s_Dictionary"],
["Talk is cheap. Show me the code.",
 "Linus Torvalds", "http://lkml.org/lkml/2000/8/25/132"],
["E = mc&#178;",
 "Albert Einstein", "http://fourmilab.ch/etexts/einstein/E_mc2/www/"],
["Not to be absolutely certain is, I think, one of the essential things in rationality.",
 "Bertrand Russell", "http://positiveatheism.org/hist/russell8.htm"],
["Freedom is the freedom to say that two plus two make four. If that is granted, all else follows.",
 "Winston Smith", "http://en.wikipedia.org/wiki/Nineteen_Eighty-Four"],
["Science is what we understand well enough to explain to a computer. Art is everything else we do.",
 "Donald Knuth", "http://www.cis.upenn.edu/~wilf/foreword.pdf"],
["The fact that we live at the bottom of a deep gravity well, on the surface of a gas covered planet going around a nuclear fireball 90 million miles away and think this to be normal is obviously some indication of how skewed our perspective tends to be.",
 "Douglas Adams", "http://biota.org/people/douglasadams/"],
["Isn't it enough to see that a garden is beautiful without having to believe that there are fairies at the bottom of it too?",
 "Douglas Adams", "http://en.wikiquote.org/wiki/The_Hitchhiker%27s_Guide_to_the_Galaxy#Chapter_16"],
["If I have seen further it is by standing on the shoulders of Giants.",
 "Isaac Newton", "http://en.wikiquote.org/wiki/Isaac_Newton"],
["The question of whether Machines Can Think ... is about as relevant as the question of whether Submarines Can Swim.",
 "Edsger W. Dijkstra", "http://cs.utexas.edu/users/EWD/transcriptions/EWD08xx/EWD898.html"],
["Elegance is not a dispensable luxury but a quality that decides between success and failure.",
 "Edsger W. Dijkstra", "https://www.cs.utexas.edu/users/EWD/transcriptions/EWD12xx/EWD1284.html"],
["I'm sorry, Dave. I'm afraid I can't do that.",
 "HAL 9000", "http://imdb.com/title/tt0062622/quotes"],
["Mathematics is less related to accounting than it is to philosophy.",
 "Leonard Adleman", "http://www.nytimes.com/1994/12/13/science/scientist-at-work-leonard-adleman-hitting-the-high-spots-of-computer-theory.html?pagewanted=2"],
["When two trains approach each other at a crossing, both shall come to a full stop and neither shall start up again until the other has gone.",
 "Kansas Legislature", "http://en.wikipedia.org/wiki/Deadlock"],
["Nature is nowhere accustomed more openly to display her secret mysteries than in cases where she shows traces of her workings apart from the beaten path.",
 "William Harvey", "http://en.wikisource.org/wiki/Page:The_Works_of_William_Harvey_%28part_2_of_2%29.djvu/98"],
["Any sufficiently advanced technology is indistinguishable from magic.",
 "Arthur C. Clarke", "http://groups.google.com/group/rec.arts.sf.misc/msg/e4185210a85826fc"],
["You cannot do inference without making assumptions.",
 "David J.C. MacKay", "http://www.inference.phy.cam.ac.uk/mackay/itila/"],
["Probability theory is nothing but common sense reduced to calculation.",
 "Pierre-Simon Laplace", "https://archive.org/details/philosophicaless00lapliala"],
["Nature laughs at the difficulties of integration.",
 "Pierre-Simon Laplace", "https://books.google.com/books?id=IsHuAAAAMAAJ"],
["The actual science of Logic is conversant at present only with things either certain, impossible, or entirely doubtful, none of which (fortunately) we have to reason on. Therefore the true Logic for this world is the Calculus of Probabilities.",
 "James Clerk Maxwell", "https://books.google.com/books?id=zfM8AAAAIAAJ&pg=PA197"],
["We are all under an ego-driven temptation to project our private thoughts out onto the real world, by supposing that the creations of one's own imagination are real properties of Nature, or that one's own ignorance signifies some kind of indecision on the part of Nature.",
 "E. T. Jaynes", "http://bayes.wustl.edu/etj/articles/cmystery.pdf"],
["The fundamental, inescapable distinction between probability and frequency lies in this relativity principle: probabilities change when we change our state of knowledge, frequencies do not.",
 "E. T. Jaynes", "https://books.google.com/books?id=tTN4HuUNXjgC&pg=PA292"],
["Just as there is a trade-off between program size and running time, there is a trade-off between the number of bits of axioms one assumes and the size of proofs.",
 "Gregory J. Chaitin", "https://www.cs.auckland.ac.nz/~chaitin/georgia.html"],
["I hated types, I admit that. And when I hate something, I go study it.",
 "Matthias Felleisen", "https://twitter.com/bodil/status/618092103336357890"],
["No computer has ever been designed that is ever aware of what it's doing; but most of the time, we aren't either.",
 "Marvin Minsky", "http://www.computerhistory.org/fellowawards/hall/bios/Marvin,Minsky/"],
["In general, we're least aware of what our minds do best.",
 "Marvin Minsky", "https://en.wikipedia.org/wiki/Moravec%27s_paradox"],
["The so-called obvious was repeatedly scrutinized from every angle and was frequently found to be not obvious but false. \"Obvious\" is the most dangerous word in mathematics.",
 "Eric Temple Bell", "https://en.wikiquote.org/wiki/Eric_Temple_Bell"],
["We see things not as they are, but as we are.",
 "Anonymous", "https://quoteinvestigator.com/2014/03/09/as-we-are/"],
["Man can do what he wills but he cannot will what he wills.",
 "Arthur Schopenhauer", "https://en.wikiquote.org/wiki/Arthur_Schopenhauer"],
["It is difficult to get a man to understand something, when his salary depends upon his not understanding it!",
 "Upton Sinclair", "https://en.wikiquote.org/wiki/Upton_Sinclair"],
["The major difference between a thing that might go wrong and a thing that cannot possibly go wrong is that when a thing that cannot possibly go wrong goes wrong it usually turns out to be impossible to get at or repair.",
 "Douglas Adams", "http://wiki.c2.com/?DouglasAdamsQuotes"],
["Remember that there is only one important time and it is Now. The present moment is the only time over which we have dominion.",
 "Leo Tolstoy", "https://www.goodreads.com/quotes/413654"],
["This too shall pass.",
 "Persian adage", "https://en.wikipedia.org/wiki/This_too_shall_pass"],
["The artist deals with what cannot be said in words. The artist whose medium is fiction does this in words. The novelist says in words what cannot be said in words.",
 "Ursula K. Le Guin", "https://www.goodreads.com/quotes/335835"],
["All of humanity's problems stem from man's inability to sit quietly in a room alone.",
 "Blaise Pascal", "https://www.goodreads.com/quotes/19682"],
["I have only made this letter longer because I have not had the time to make it shorter.",
 "Blaise Pascal", "https://www.goodreads.com/quotes/21224"],
["People almost invariably arrive at their beliefs not on the basis of proof but on the basis of what they find attractive.",
 "Blaise Pascal", "https://www.goodreads.com/quotes/104957"],
["You always admire what you really don't understand.",
 "Blaise Pascal", "https://www.goodreads.com/quotes/3296"],
["Problems that remain persistently insoluble should always be suspected as questions asked in the wrong way.",
 "Alan Watts", "https://www.goodreads.com/quotes/285472"],
["Every intelligent individual wants to know what makes him tick, and yet is at once fascinated and frustrated by the fact that oneself is the most difficult of all things to know.",
 "Alan Watts", "https://www.goodreads.com/quotes/122459"],
["INSUFFICIENT DATA FOR MEANINGFUL ANSWER",
 "Multivac", "http://multivax.com/last_question.html"]
]
